{
  "backend/main.mo": "Motoko canister answering user questions with pattern-matched predefined responses for topics like costs, privacy, science, and ICP info.",
  "feature_evidence.json": "Feature evidence report listing branding, asset integration, and theming requirements with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including App.tsx, hooks, styles, Tailwind config, and index.html.",
  "frontend/.env.example": "Example environment file showing how to configure the VITE_DEPLOYMENT_URL variable.",
  "frontend/index.css": "Tailwind base stylesheet defining warm OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point setting the AI Logic title and favicon and loading the main React bundle.",
  "frontend/src/App.tsx": "Main React chat UI handling messages, backend queries, example prompts, and displaying branding images in the header.",
  "frontend/src/components/AppLinkSection.tsx": "Component showing the deployment URL with copy-to-clipboard support and fallback text when unavailable.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches the backend actor based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity login, stored identities, and login state transitions.",
  "frontend/src/hooks/useQueries.ts": "React Query mutation for sending questions to the backend actor with validation and cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind layers and OKLCH CSS variables for light/dark themes and applies global base styles.",
  "frontend/src/lib/deployConfig.ts": "Exports the deployment URL from environment variables for displaying shareable links.",
  "frontend/src/lib/domainValidation.ts": "Provides domain normalization and validation enforcing 5–50 chars of letters, numbers, and hyphens.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens tied to CSS variables, plugins, and animations.",
  "project_state.json": "Stores project metadata, feature definitions, requirements, and branding image tasks."
}