{
  "kind": "build_request",
  "title": "Add AI Logic branding images inspired by Grok AI and ChatGPT style",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Generate original branding images for AI Logic with a modern minimal AI-assistant aesthetic similar in vibe to Grok AI and ChatGPT (clean, high-contrast, subtle gradients), without copying or tracing any protected logos or exact assets.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the image must be like grok ai and chat gpt"
        ]
      },
      "acceptanceCriteria": [
        "New images are generated as specified in imageRequirements.required",
        "The visuals feel consistent with a modern AI-chat brand (minimal, premium, subtle gradients) while remaining clearly original (not a copy of Grok/ChatGPT marks)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add the generated branding images as static assets under frontend/public/assets/generated and render them in the UI: replace the current header bot icon with the generated AI Logic logo mark, and use the favicon image in the HTML head.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the image must be like grok ai and chat gpt"
        ]
      },
      "acceptanceCriteria": [
        "Generated files exist under frontend/public/assets/generated with the exact filenames from imageRequirements.required",
        "The header in frontend/src/App.tsx displays the new logo image instead of the lucide Bot icon (layout remains aligned and sized appropriately)",
        "frontend/index.html includes a favicon <link> referencing the generated favicon file",
        "No backend changes are required for image rendering"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the updated branding visuals remain consistent with the existing Tailwind theme tokens and do not introduce a new blue/purple-dominant palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the image must be like grok ai and chat gpt"
        ]
      },
      "acceptanceCriteria": [
        "UI continues using existing CSS variables / Tailwind tokens for colors",
        "No new global theme changes that shift the app into a blue/purple-dominant look"
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui",
    "Do not add any backend endpoints or route image delivery through the backend; images must be served as static frontend assets",
    "Do not copy, trace, or recreate Grok AI or ChatGPT logos/wordmarks; only create original visuals with a similar general aesthetic"
  ],
  "nonGoals": [
    "Implementing new chat features (memory, streaming, multi-chat, real-time)",
    "Changing backend answer logic or adding new backend storage",
    "Adding third-party authentication beyond existing Internet Identity setup"
  ],
  "imageRequirements": {
    "required": [
      "Minimal abstract AI logo mark with subtle gradient on dark background (ai-logic-logo.dim_512x512.png)",
      "Simplified monochrome/duotone favicon version of the logo mark (ai-logic-favicon.dim_32x32.png)",
      "Wide minimal header/hero background with soft gradient and light noise texture, no text (ai-logic-hero.dim_1600x400.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Branding images should have a visual vibe similar to Grok AI and ChatGPT (modern, minimal, premium), while remaining original."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}